app/controllers/galleries_controller.rb

SELECT "galleries".* FROM "galleries"
---
  def index
    @galleries = Gallery.all

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def show
    @gallery = Gallery.find(params[:id])

INSERT INTO "galleries" ("name", "city", "state", "zip", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @gallery = Gallery.new(gallery_params)
    if @gallery.save